#列表的增删改查

#新增
#注意列表和字符串不一样,列表是可以发生改变的 所以直接在原来的对象上进行了操作,而字符串是不可改变的

lst = []
lst.append("周杰伦") #追加 永远在最后添加  效率比较高
lst.append("周芷若")
lst.append("周公瑾")
print(lst)

lst = [ "刘德华","渣渣辉","古天乐","陈小春"]
lst.insert(2,"马德华") #插入 可能会导致元素移动  查找最后位置元素是不移动的
print(lst)


#expend 迭代添加,

lst = [ "刘昊然","张一山","徐峥","黄渤"]
lst.extend("刘能")  #是可迭代对象,就是for循环可以遍历
print(lst) # ['刘昊然', '张一山', '徐峥', '黄渤', '刘', '能']
lst.extend(["刘能","赵四","广坤"]) #列表是可迭代的,一个一个的往外拿







#2. 列表的删除

# pop remove clear del

lst = [ "刘能","广坤","皮长山","大脚"]

print(lst)
#
# s1 = lst.pop() #默认弹出最后一个
# print(s1)
# s2 = lst.pop()
# print(s2)

lst.remove("广坤")  #指定要删除的元素
print(lst)

lst = ["语文","数学","英语","化学","历史"]
# lst.clear() #清空
# print(lst)

del lst[1:3]  #可以切片删除
print(lst)


# 3. 修改列表的元素

lst = ["功夫","大话西游","少林寺","无间道","战狼","战狼2"]

# lst[2] = "西西里的美丽传说"
# lst[-3] = "新世界"
# lst[1:3] = ["一步之遥"]

lst[1:5:2] = ["胡辣汤","烩面"]   # 替换两个位置如果只给一个 元素会报错,所以替换的个数要匹配
print(lst)


# 4.查询
#列表是一个可迭代对象,可以使用for循环

for e in lst:
    print(e)
