# s = "刘德华很帅但是张国荣帅"
# print(type(s))
# print(s[0]) #第一
# print(s[2])
# print(s[4])
# print(s[-1]) #倒数第一
# print(s[-4]+s[-3]+s[-2])
#
#
# #切片  s[start:end]  顾头不顾尾 默认的放心是从左往右切
# print(s[7:10])
# print(s[0:3])
# print(s[-4:-1])  #无论正还是反切都是从小到大
#
#
# #从德切到结尾
# print(s[1:])  #切到尾
# print(s[:5])  #从头切
# print(s[:])   #从头到尾

# s = "你今天中午准备吃什么?"
# print(s[1:5])
# print(s[1:5:1])   #默认是1 一个一个的取
# print(s[1:5:-1])   #反方向取 从右往左取  这里是空
# print(s[5:1:-1])   #反方向取 从右往左取  这里是从  顾头不顾尾
#
# #第三个参数是步长
# print(s[1:5:2])
# print(s[1:5:3])

# s = "0123456789"
# print(s[4:8:2])  #可以理解每两个一组,取最左边的
# print(s[::2])
#
# s= "我要开始玩幺蛾子了你们怕不怕我很怕"
# print(s[-1:-6:-2])
# print(s[::-3])
# print(s[::-1])


s = "上海自来水来自海上"  #回文  如121

s1 = [::-1]
if s == s1:
    print("是回文")
else:
    print("不是回文")

# 切片: str[start : end : step]
# start:起始位置
# end :结束为止 顾头不顾尾
# step: 步长 默认是1  从左往右取 -1是从右往左取

